Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/device/serial_flash/r_tfat_drv_if_flash.c
/***********************************************************************************************************************
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/**********************************************************************************************************************
* File Name    : r_tfat_drv_if_flash.c
* Description  : TFAT driver Interface for FLASH memory.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 10.06.2020 1.00    First Release
*              : 10.09.2020 2.20    Revised the processing of the flash_spi_disk_ioctl function. The value of
*                                   GET_BLOCK_SIZE is fixed to 16.
*              : 15.12.2023 2.40    Added support FLASH SPI sector size selectable.
*                                   Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*              : 30.09.2024 2.60    Changed the comment of API functions to the Doxygen style.
*              : 15.03.2025 2.61    Updated disclaimer.
***********************************************************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
*******************************************************************************/
#include <string.h>
#include "r_tfat_drv_if_dev.h"
#include "r_tfat_driver_rx_config.h"

#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
#include "ff.h"              /* TFAT define */
#include "diskio.h"              /* TFAT define */

#include "r_flash_spi_if.h"

/*******************************************************************************
Macro definitions
*******************************************************************************/
#define FLASH_WRITE_PROTECT_OPEN        (1)
#define FLASH_WRITE_PROTECT_CLOSE       (0)
#define FLASH_WRITE_PROTECT_STATUS      (0x3c)

/* Sector Erase busy timeout 200*1ms = 0.2s  */
/** SET **/
#define FLASH_SE_BUSY_WAIT              (200)
/* Page Program time out 3*1ms = 3ms */
/** SET **/
#define FLASH_PP_BUSY_WAIT              (3)
/* Write Register time out 40*1ms = 40ms */
/** SET **/
#define FLASH_WR_BUSY_WAIT              (40)
#define FLASH_BUSY                      (0x01)
#define FLASH_NO_BUSY                   (0x00)

/*  Flash SPI default configuration for TFAT usage */
#define FLASH_PAGE_SIZE                 (256)
#define FLASH_ERASE_SECTOR_SIZE         (4096)
#define FAT_SECTOR_CNT_BY_ERASE_SECTOR  (FLASH_ERASE_SECTOR_SIZE/TFAT_FLASH_SECTOR_SIZE)
#define FLASH_PAGE_CNT_BY_FAT_SECTOR    (TFAT_FLASH_SECTOR_SIZE/FLASH_PAGE_SIZE)

#define BIT_PER_BYTE_SHIFT              (8)

#define TIMER_MAX_CH                    (8)
#define TIMER_CH_FLG                    (0)
#define TIMER_CH_COUNT                  (1)
#define TIMER_CH_MAX_COUNT              (2)

#define FLASH_OK                        (0)
#define FLASH_ERROR                     (-1)
/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
*******************************************************************************/
static uint32_t    gs_timer_cnt_out[TIMER_MAX_CH][TIMER_CH_MAX_COUNT + 1];

static flash_spi_status_t flash_spi_busy_check (uint8_t driver,
                    flash_spi_poll_mode_t mode, uint32_t loop_cnt);
static int8_t flash_spi_wait_time (uint32_t channel, uint32_t time);
static int8_t flash_spi_start_timer (uint32_t channel, uint32_t msec);
static int8_t flash_spi_check_timer (uint32_t channel);
static int8_t flash_spi_end_timer (uint32_t channel);


/**********************************************************************************************************************
* Function Name: flash_spi_disk_initialize
*******************************************************************************************************************//**
* @brief This function initializes the disk drive.
*
* @param[in] drive  Specifies the initialize drive number.
*
* @retval TFAT_RES_OK  Normal termination.
*
* @retval Others       DSTATUS status of the disk after function execution.
*
* @details This function does not execute the Serial Flash memory driver initialize. Please implement Serial
* Flash memory initialize code in user code.
* @note None
*/
DSTATUS flash_spi_disk_initialize(uint8_t drive)
{
    uint8_t                 flash_status;       // Flash status

    flash_spi_status_t      ret = FLASH_SPI_SUCCESS;

    /* Read flash status */
    ret = R_FLASH_SPI_Read_Status(drive, &flash_status);
    if (FLASH_SPI_SUCCESS > ret)
    {
        return STA_NOINIT;
    }

    if (0 != (flash_status & FLASH_BUSY))
    {
        return STA_NOINIT;                      // Flash is busy
    }

    return RES_OK;
} /* End of function flash_spi_disk_initialize() */


/**********************************************************************************************************************
* Function Name: flash_spi_disk_read
*******************************************************************************************************************//**
* @brief This function reads the data from disk.
*
* @param[in]  drive  Specifies the physical drive number.
*
* @param[out] buffer Pointer to the read buffer to store the read data. A buffer of the size equal to the
* number of bytes to be read is required.
*
* @param[in]  sector_number  Specifies the start sector number in logical block address (LBA).
*
* @param[in]  sector_count   Specifies number of sectors to read. The value can be 1 to 255.
*
* @retval DRESULT  Result of the function execution.
*
* @details Read data from Serial Flash memory by block.
* @note None
*/
DRESULT flash_spi_disk_read (
    uint8_t drive,               /* Physical drive number            */
    uint8_t* buffer,             /* Pointer to the read data buffer  */
    uint32_t sector_number,      /* Start sector number              */
    uint32_t sector_count        /* Number of sectors to read        */
)
{
    flash_spi_info_t        Flash_Info_R;
    flash_spi_status_t      ret = FLASH_SPI_SUCCESS;

