Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/device/serial_flash/r_tfat_drv_if_flash.c
    /* Set flash read arguments */
    Flash_Info_R.addr       = (uint32_t)(sector_number * TFAT_FLASH_SECTOR_SIZE);
    Flash_Info_R.cnt        = (uint32_t)(sector_count * TFAT_FLASH_SECTOR_SIZE);
    Flash_Info_R.p_data     = buffer;
    Flash_Info_R.op_mode    = FLASH_SPI_SINGLE;

    /* Read flash data */
    ret = R_FLASH_SPI_Read_Data(drive, &Flash_Info_R);
    if (FLASH_SPI_SUCCESS > ret)
    {
        return RES_ERROR;
    }

    return RES_OK;
} /* End of function flash_spi_disk_read() */

/* FAT sector structure definition */
typedef struct
{
    uint32_t erase_fat_sector_start;
    uint32_t erase_fat_sector_cnt;
    uint32_t program_fat_sector_start;
    uint32_t program_fat_sector_cnt;
} fat_sector_written_info_t;

typedef struct
{
    fat_sector_written_info_t head_sector_info;
    fat_sector_written_info_t midl_sector_info;
    fat_sector_written_info_t tail_sector_info;
} fat_sector_written_map_t;

/* Write sector size */
DRESULT flash_spi_disk_write_fat_sector(
    uint8_t drive,                /* Physical drive number           */
    const uint8_t* buffer,        /* Pointer to the write data       */
    uint32_t fat_sector           /* Sector number to write          */
)
{
    uint8_t* p_buffer = (uint8_t*)buffer;
    flash_spi_status_t rst_flash = FLASH_SPI_SUCCESS;
    flash_spi_info_t flash_spi_info;
    uint32_t page;
    
    /* WAIT_LOOP */
    for (page = 0;
        page < FLASH_PAGE_CNT_BY_FAT_SECTOR;
        page++, p_buffer += FLASH_PAGE_SIZE)
    {
        /* Write page */
        flash_spi_info.addr = fat_sector * TFAT_FLASH_SECTOR_SIZE +
                                        page * FLASH_PAGE_SIZE;
        flash_spi_info.cnt = FLASH_PAGE_SIZE;
        flash_spi_info.p_data = p_buffer;
        flash_spi_info.op_mode = FLASH_SPI_SINGLE;
        rst_flash = R_FLASH_SPI_Write_Data_Page(drive, &flash_spi_info);
        if (FLASH_SPI_SUCCESS != rst_flash)
        {
            return RES_ERROR;
        }
        rst_flash = flash_spi_busy_check(drive, FLASH_SPI_MODE_PROG_POLL,
                                                        FLASH_PP_BUSY_WAIT);
        if (FLASH_SPI_SUCCESS != rst_flash)
        {
            return RES_ERROR;
        }
    }
    return RES_OK;
}

/* erase sector size: 4KB */
static uint32_t g_buffer_flash_sector[FLASH_ERASE_SECTOR_SIZE / sizeof(uint32_t) * sizeof(uint8_t)] = {0};
DRESULT flash_spi_disk_write_erase_sectors(
    uint8_t drive,                /* Physical drive number           */
    const uint8_t* buffer,        /* Pointer to the write data       */
    fat_sector_written_info_t* p_written_info
)
{
    DRESULT ret = RES_OK;
    flash_spi_erase_info_t flash_spi_erase_info;
    uint32_t erase_sector;
    uint32_t sector;
    uint8_t *p_buff;
    if (0 != p_written_info->erase_fat_sector_cnt
        && 0 != p_written_info->program_fat_sector_cnt)
    {
        /* Whether write over data in g_buffer_flash_sector or not */
        if (p_written_info->erase_fat_sector_cnt
            == p_written_info->program_fat_sector_cnt)
        {
            /* p_written_info is middle part, therefore it doesn't need to
               write over g_buffer_flash_sector */
            p_buff = (uint8_t*)buffer;
        }
        else
        {
            /* p_written_info is fragment, head, or tail, therefore it needs to
               write over g_buffer_flash_sector */
            /* Read a flash erase sector to keep data */
            ret = flash_spi_disk_read(drive, (uint8_t*)g_buffer_flash_sector, 
                p_written_info->erase_fat_sector_start, 
                p_written_info->erase_fat_sector_cnt);
            if(RES_OK != ret)
            {
                return ret;
            }
            /* Write over data in g_buffer_flash_sector */
            memcpy((uint8_t*)g_buffer_flash_sector +
                (p_written_info->program_fat_sector_start - p_written_info->erase_fat_sector_start) * TFAT_FLASH_SECTOR_SIZE,
                (uint8_t*)buffer,
                p_written_info->program_fat_sector_cnt * TFAT_FLASH_SECTOR_SIZE);

                p_buff = (uint8_t*)g_buffer_flash_sector;
        }
        
        /* Erase a flash erase sector */
        /* WAIT_LOOP */
        for (erase_sector = 0; 
            erase_sector < p_written_info->erase_fat_sector_cnt; 
            erase_sector += FAT_SECTOR_CNT_BY_ERASE_SECTOR)
        {
            flash_spi_erase_info.addr = (p_written_info->erase_fat_sector_start + erase_sector) * TFAT_FLASH_SECTOR_SIZE;
            flash_spi_erase_info.mode = FLASH_SPI_MODE_S_ERASE;
            if (FLASH_SPI_SUCCESS !=
                R_FLASH_SPI_Erase(drive, &flash_spi_erase_info))
            {
                return RES_ERROR;
            }
            if (FLASH_SPI_SUCCESS != flash_spi_busy_check(drive, FLASH_SPI_MODE_ERASE_POLL, FLASH_SE_BUSY_WAIT))
            {
                return RES_ERROR;
            }
        }
        
        /* Program data which is written over as needed
           in flash erase sectors */
        /* WAIT_LOOP */
        for (sector = 0;
            sector < p_written_info->erase_fat_sector_cnt;
            sector++, p_buff += TFAT_FLASH_SECTOR_SIZE)
        {
            ret = flash_spi_disk_write_fat_sector(drive, p_buff,
                    p_written_info->erase_fat_sector_start + sector);
            if (RES_OK != ret)
            {
                return ret;
            }
        }
    }
    else if (0 == p_written_info->erase_fat_sector_cnt
            && 0 == p_written_info->program_fat_sector_cnt)
    {
        return RES_OK;
    }
    else
    {
        /* fat_sector_written_info_t member has error value */
        return RES_PARERR;
    }
    return ret;
}


DRESULT flash_spi_disk_write_map(uint8_t drive, const uint8_t* buffer,
                                        fat_sector_written_map_t* p_map)
{
    if (RES_OK != flash_spi_disk_write_erase_sectors(drive, buffer, &p_map->head_sector_info))
    {
        return RES_ERROR;
    }
    if (RES_OK != flash_spi_disk_write_erase_sectors(drive, 
            buffer + (p_map->head_sector_info.program_fat_sector_cnt * TFAT_FLASH_SECTOR_SIZE), 
            &p_map->midl_sector_info))
    {
        return RES_ERROR;
    }
    if (RES_OK != flash_spi_disk_write_erase_sectors(drive, 
            buffer + ((p_map->midl_sector_info.program_fat_sector_cnt + p_map->head_sector_info.program_fat_sector_cnt) * TFAT_FLASH_SECTOR_SIZE), 
            &p_map->tail_sector_info))
    {
        return RES_ERROR;
    }
    return RES_OK;
}

