Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/device/serial_flash/r_tfat_drv_if_flash.c
/******************************************************************************
* Function Name : get_sector_written_map
* Description   : This function calculates distribution map of written sectors 
*               :    of fat because serial flash writing process must be 
*               :    considered erasing and programing sectors of fat.
* Arguments     : uint32_t fat_sector_number : Sector number of fat to write
*               : uint32_t fat_sector_count  : Number of sectors of fat to write
*               : fat_sector_written_map_t* p_map : Sector map to write (output)
* Return value  : None
******************************************************************************/
void get_sector_written_map(
    uint32_t fat_sector_number,         /* Sector number of fat to write    */
    uint32_t fat_sector_count,          /* Number of sectors of fat to write */
    fat_sector_written_map_t* p_map     /* Sector map to write (output)    */
)
{
    uint32_t outside_sector = fat_sector_number + fat_sector_count;
    uint32_t next_erase_sector;
    uint32_t current_sector;
        p_map->head_sector_info.erase_fat_sector_cnt = 0;
        p_map->head_sector_info.program_fat_sector_cnt = 0;
        p_map->midl_sector_info.erase_fat_sector_cnt = 0;
        p_map->midl_sector_info.program_fat_sector_cnt = 0;
        p_map->tail_sector_info.erase_fat_sector_cnt = 0;
        p_map->tail_sector_info.program_fat_sector_cnt = 0;
    /* Calculate head part */
    if(0 == fat_sector_number % FAT_SECTOR_CNT_BY_ERASE_SECTOR)
    {
        /* Invalid of head part */
        current_sector = fat_sector_number;
    }
    else
    {
        p_map->head_sector_info.erase_fat_sector_start = 
                    (fat_sector_number / FAT_SECTOR_CNT_BY_ERASE_SECTOR) * FAT_SECTOR_CNT_BY_ERASE_SECTOR;
        p_map->head_sector_info.erase_fat_sector_cnt = FAT_SECTOR_CNT_BY_ERASE_SECTOR;
        p_map->head_sector_info.program_fat_sector_start = fat_sector_number;
        next_erase_sector = p_map->head_sector_info.erase_fat_sector_start +
                            FAT_SECTOR_CNT_BY_ERASE_SECTOR;
        if (outside_sector < next_erase_sector)
        {
            /* Fragment part */
            p_map->head_sector_info.program_fat_sector_cnt = fat_sector_count;
            return;
        }
        else
        {
            /* Head part */
            p_map->head_sector_info.program_fat_sector_cnt = next_erase_sector - fat_sector_number;
        }
        current_sector = next_erase_sector;
    }
    /* Calculate middle part */
    if((outside_sector - current_sector) < FAT_SECTOR_CNT_BY_ERASE_SECTOR)
    {
        /* Invalid of middle part */
        /* Do Nothing */
        R_BSP_NOP();
    }
    else
    {
        /* Middle part */
        p_map->midl_sector_info.erase_fat_sector_start = current_sector;
        p_map->midl_sector_info.erase_fat_sector_cnt = 
            ((outside_sector - current_sector) / FAT_SECTOR_CNT_BY_ERASE_SECTOR) * FAT_SECTOR_CNT_BY_ERASE_SECTOR;
        p_map->midl_sector_info.program_fat_sector_start = current_sector;
        p_map->midl_sector_info.program_fat_sector_cnt = p_map->midl_sector_info.erase_fat_sector_cnt;
        current_sector = p_map->midl_sector_info.erase_fat_sector_start + p_map->midl_sector_info.erase_fat_sector_cnt;
    }
    /* Calculate tail part */
    p_map->tail_sector_info.program_fat_sector_cnt = outside_sector - current_sector;
    if(0 == p_map->tail_sector_info.program_fat_sector_cnt)
    {
        /* Invalid of tail part */
        /* Do Nothing */
        R_BSP_NOP();
    }
    else
    {
        /* Tail part */
        p_map->tail_sector_info.erase_fat_sector_start = current_sector;
        p_map->tail_sector_info.erase_fat_sector_cnt = FAT_SECTOR_CNT_BY_ERASE_SECTOR;
        p_map->tail_sector_info.program_fat_sector_start = current_sector;
    }
    return;
}


/**********************************************************************************************************************
* Function Name: flash_spi_disk_write
*******************************************************************************************************************//**
* @brief This function writes the data to the disk.
*
* @param[in] drive  Specifies the physical drive number.
*
* @param[in] buffer Pointer to the data to be written.
*
* @param[in] sector_number  Specifies the start sector number in logical block address (LBA).
*
* @param[in] sector_count   Specifies number of sectors to write. The value can be 1 to 255.
*
* @retval DRESULT  Result of the function execution.
*
* @details Write the data to the Serial Flash memory by block.
* @note None
*/
DRESULT flash_spi_disk_write (
    uint8_t drive,                /* Physical drive number           */
    const uint8_t* buffer,        /* Pointer to the write data       */
    uint32_t sector_number,       /* Sector number to write          */
    uint32_t sector_count         /* Number of sectors to write      */
)
{
    uint8_t                 flash_status;       // flash status

    flash_spi_status_t      ret = FLASH_SPI_SUCCESS;
    fat_sector_written_map_t fat_sector_written_map;

    /* Disable the write PROTECT */
    ret = R_FLASH_SPI_Set_Write_Protect(drive, FLASH_WRITE_PROTECT_CLOSE);
    if (FLASH_SPI_SUCCESS > ret)
    {
        return RES_ERROR;
    }

    /* Disable the write PROTECT completed */
    ret = flash_spi_busy_check(drive, FLASH_SPI_MODE_REG_WRITE_POLL, FLASH_WR_BUSY_WAIT);
    if (FLASH_SPI_SUCCESS != ret)
    {
        return RES_ERROR;
    }

    ret = R_FLASH_SPI_Read_Status(drive, &flash_status);
    if (FLASH_SPI_SUCCESS > ret)
    {
        return RES_ERROR;
    }

    if (0 != (flash_status & FLASH_WRITE_PROTECT_STATUS))   // Write protect is disable
    {
        return RES_WRPRT;
    }

    /* Calculate position of fat sectors which is erased and programed */
    get_sector_written_map(sector_number, sector_count, &fat_sector_written_map);
    /* Write data to serial flash */
    if (RES_OK != flash_spi_disk_write_map(drive, (uint8_t*)buffer, &fat_sector_written_map))
    {
        return RES_ERROR;
    }

