Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/device/serial_flash/r_tfat_drv_if_flash.c
    /* Enable write PROTECT */
    ret = R_FLASH_SPI_Set_Write_Protect(drive, FLASH_WRITE_PROTECT_OPEN);
    if (FLASH_SPI_SUCCESS > ret)
    {
        return RES_ERROR;
    }
    
    ret = flash_spi_busy_check(drive, FLASH_SPI_MODE_REG_WRITE_POLL, FLASH_WR_BUSY_WAIT);
    if (FLASH_SPI_SUCCESS != ret)
    {
        return RES_ERROR;
    }

    return RES_OK;
} /* End of function flash_spi_disk_write() */


/**********************************************************************************************************************
* Function Name: flash_spi_disk_ioctl
*******************************************************************************************************************//**
* @brief This function controls the drive.
*
* @param[in] drive   Specifies the physical drive number.
*
* @param[in] command Specifies the command code. The command code will always be 0.
*
* @param[in] buffer  Pointer should always be a NULL pointer.
*
* @retval DRESULT  Result of the function execution.
*
* @details The flash_spi_disk_ioctl function is used only by the f_sync or f_mkfs function amongst all the TFAT
* FIT functions. Users who do not plan to use f_sync function in their applications can skip the implementation
* for this particular driver interface function.\n
* For users who wish to use f_sync function in their applications, the command CTRL_SYNC has to be implemented.\n
* The command CTRL_SYNC should consist of the code to finish off any pending write process. If the disk i/o module
* has a write back cache, the dirty sector must be flushed immediately. The f_sync function will perform a save
* operation to the unsaved data related to the file object passed as argument.\n
* For other commands, see Section 4.6.4 in the application note for details.
* @note None
*/
DRESULT flash_spi_disk_ioctl (
    uint8_t drive,                /* Drive number             */
    uint8_t command,              /* Control command code     */
    void* buffer                  /* Data transfer buffer     */
)
{
    uint8_t             cmd = command;
    flash_spi_status_t      ret = FLASH_SPI_SUCCESS;
#if FF_FS_READONLY == 0
    uint8_t                 flash_status;       // flash status
#endif
#if FF_USE_MKFS == 1
    uint32_t                flash_size;
    flash_spi_mem_info_t Flash_MemInfo;
#endif

    if ((NULL == buffer) && (CTRL_SYNC != cmd))
    {
        return RES_PARERR;
    }

    switch (cmd)
    {
        case CTRL_SYNC:
#if FF_FS_READONLY == 0
            /* Read FLASH status */
            ret = R_FLASH_SPI_Read_Status(drive, &flash_status);
            if (FLASH_SPI_SUCCESS > ret)
            {
                return RES_ERROR;
            }
            
            if (0 != (flash_status & FLASH_BUSY))
            {
                return RES_NOTRDY;             // Flash is busy
            }
            else
            {
                R_BSP_NOP();          // Flash isn't busy
            }
#endif
        break;
        
        case GET_SECTOR_COUNT:
#if FF_USE_MKFS == 1
            /* Get Flash memory information */
            ret = R_FLASH_SPI_GetMemoryInfo(drive, &Flash_MemInfo);
            if (FLASH_SPI_SUCCESS != ret)
            {
                return RES_ERROR;
            }
            
            flash_size = (Flash_MemInfo.mem_size / TFAT_FLASH_SECTOR_SIZE);
            ((uint32_t *)buffer)[0] = flash_size;       // Return the total number of sectors
#endif
        break;
        
        case GET_SECTOR_SIZE:
#if FF_MAX_SS != FF_MIN_SS
            flash_size = TFAT_FLASH_SECTOR_SIZE;
            ((uint32_t *)buffer)[0] = flash_size;       // Return the sector size of flash
#endif
        break;
        
        case GET_BLOCK_SIZE:
#if FF_USE_MKFS == 1
            ((uint32_t *)buffer)[0] = FAT_SECTOR_CNT_BY_ERASE_SECTOR;               // Sector count per erasable block
#endif
        break;
        
        case CTRL_TRIM:
            
        break;
        
        default:
            return RES_PARERR;
        break;
    }

    return RES_OK;
} /* End of function flash_spi_disk_ioctl() */


/**********************************************************************************************************************
* Function Name: flash_spi_disk_status
*******************************************************************************************************************//**
* @brief This function gets the disk drive status.
*
* @param[in] drive  Specifies the physical drive number.
*
* @retval TFAT_RES_OK  Normal termination.
*
* @retval Others       DSTATUS status of the disk after function execution.
*
* @details This function should consist of the code that checks the disk and returns the current disk status.
* The disk status can have any of the three values, see Section 2.10 in the application note for details.
* The disk status can be returned by updating the return value with the macros related to disk status.
* @note None
*/
DSTATUS flash_spi_disk_status (
    uint8_t drive                  /* Physical drive number    */
)
{
    uint8_t                 flash_status;           // flash status
    flash_spi_status_t      ret = FLASH_SPI_SUCCESS;

    ret = R_FLASH_SPI_Read_Status(drive, &flash_status);
    if (FLASH_SPI_SUCCESS != ret)
    {
        return STA_NODISK;
    }

    if (0 != (flash_status & FLASH_BUSY))
    {
        return STA_NOINIT;                          //Flash is busy
    }
    else
    {
        R_BSP_NOP();
    }

    return RES_OK;
} /* End of function flash_spi_disk_status() */


/**********************************************************************************************************************
* Function Name: flash_spi_1ms_interval
*******************************************************************************************************************//**
* @brief This function updates the internal timer per 1 ms.
*
* @details This function updates the internal timer of the TFAT driver FIT per 1 ms. This timer is used to check
* the busy status of the serial flash memory.
* @note None
*/
void flash_spi_1ms_interval (void)
{
    uint32_t channel = 0;

    /* WAIT_LOOP */
    for (channel = 0; channel < TIMER_MAX_CH; channel++)
    {
        if (0 != gs_timer_cnt_out[channel][TIMER_CH_FLG])
        {
            gs_timer_cnt_out[channel][TIMER_CH_COUNT]++;
        }
    }

    return;
} /* End of function flash_spi_1ms_interval() */

