Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/device/serial_flash/r_tfat_drv_if_flash.c
/******************************************************************************
* Function Name : flash_spi_busy_check
* Description   : This function is used to check flash memory status
*               :    of the disk
* Arguments     : flash_spi_poll_mode_t mode          Mode of error check
*                 uint32_t loop_cnt                   loop counter(ms)
* Return value  : Result of function execution
******************************************************************************/
static flash_spi_status_t flash_spi_busy_check (
    uint8_t driver,                     /* channel number */
    flash_spi_poll_mode_t mode,         /* Poll mode */
    uint32_t loop_cnt                   /* loop count for 1ms */
)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS_BUSY;

    do
    {
        /* FLASH is busy.
           User application can perform other processing while flash is busy. */

        ret = R_FLASH_SPI_Polling(driver, mode);
        if (FLASH_SPI_SUCCESS_BUSY != ret)
        {
            /* FLASH is ready or error. */
            break;
        }
        loop_cnt--;
        flash_spi_wait_time(driver, 1);     // 1 ms
    }
    while (0 != loop_cnt); /* WAIT_LOOP */

    return ret;
} /* End of function flash_spi_busy_check() */

/******************************************************************************
* Function Name : flash_spi_wait_time
* Description   : This function is used to wait for specified time
*               :    of the disk
* Arguments     : uint32_t channel       timer channel number
*                 uint32_t time          timeout(ms)
* Return value  : Result of function execution
******************************************************************************/
static int8_t flash_spi_wait_time (
    uint32_t channel,                    /* timer channel No. */
    uint32_t time                        /* timeout value */
)
{
    if (flash_spi_start_timer(channel, time) == FLASH_ERROR)
    {
        return FLASH_ERROR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Timeout? */
        if (FLASH_ERROR == flash_spi_check_timer(channel))
        {
            break;
        }
    }

    flash_spi_end_timer(channel);

    return FLASH_OK;
} /* End of function flash_spi_wait_time() */

/******************************************************************************
* Function Name : flash_spi_start_timer
* Description   : This function is used to start timer
*               :    of the disk
* Arguments     : uint32_t channel       timer channel number
*                 uint32_t msec          timeout(ms)
* Return value  : Result of function execution
******************************************************************************/
static int8_t flash_spi_start_timer (
    uint32_t channel,                    /* timer channel No. */
    uint32_t msec                        /* timeout value */
)
{
    if (TIMER_MAX_CH <= channel)
    {
        return FLASH_ERROR;
    }

    /* ---- Check argument ---- */
    if ((0 >= msec) || (msec > 0x0fffffff))
    {
        return FLASH_ERROR;
    }
    gs_timer_cnt_out[channel][TIMER_CH_FLG] = 1;
    gs_timer_cnt_out[channel][TIMER_CH_COUNT] = 0;
    gs_timer_cnt_out[channel][TIMER_CH_MAX_COUNT] = msec;

    return FLASH_OK;
} /* End of function flash_spi_start_timer() */

/******************************************************************************
* Function Name : flash_spi_check_timer
* Description   : This function is used to check timeout
*               :    of the disk
* Arguments     : uint32_t channel       timer channel number
* Return value  : Result of function execution
******************************************************************************/
static int8_t flash_spi_check_timer (
    uint32_t channel                   /* timer channel No. */
)
{
    int8_t ret = 0;

    /* ---- Check compare ---- */
    if (gs_timer_cnt_out[channel][TIMER_CH_COUNT] >= gs_timer_cnt_out[channel][TIMER_CH_MAX_COUNT])
    {
        ret = FLASH_ERROR;
    }
    else
    {
        ret = FLASH_OK;
    }

    return ret;
} /* End of function flash_spi_check_timer() */

/******************************************************************************
* Function Name : flash_spi_end_timer
* Description   : This function is used to end the timer
* Arguments     : uint32_t channel       timer channel number
* Return value  : Result of function execution
******************************************************************************/
static int8_t flash_spi_end_timer (
    uint32_t channel                   /* timer channel No. */
)
{
    gs_timer_cnt_out[channel][TIMER_CH_FLG] = 0;

    return FLASH_OK;
} /* End of function flash_spi_end_timer() */

#endif /* (TFAT_SERIAL_FLASH_DRIVE_NUM > 0) */
/******************************************************************************
End  Of File
******************************************************************************/
